let ver_item ={
  "１だん": {
    "1だん後半★★★★ピックアップ": [
      "ポッピンハートバズリウム",
      "ミラクルムーンバズリウム",
      "スカーレットバタフライバズリウム",
      "おうしざエメラルド",
      "おとぎばなしシンデレラ",
      "おとぎばなしシンデレライエロー",
      "キューティーラビット",
      "キューティーラビットブルー",
      "リッチベリータルト",
      "リッチベリータルトピンク",
      "バタフライマジック",
      "バタフライマジッククリムゾン"
    ],
    "ワッチャプリマジ！": [
      "ハートフェザー",
      "マナマナみゃむ",
      "おとめマーガレット",
      "プリマジチェックピンク"
    ],
    "1だん前半★★★★ピックアップ": [
      "ポッピンハートバズリウム",
      "ミラクルムーンバズリウム",
      "おひつじざルビー",
      "ドーナツパティシエール",
      "ドーナツパティシエールオレンジ",
      "ぷるるんゼリーソーダ",
      "ぷるるんゼリーグレープ",
      "ウェルカムチェリー",
      "ウェルカムチェリーブルー",
      "きらきらくらげブルー",
      "きらきらくらげピンク"
    ],
    "プリティーリズム・オーロラドリーム": [
      "ひみつのオーロラドリームあいら",
      "ひみつのオーロラドリームりずむ",
      "ひみつのオーロラドリームみおん",
      "ピュアプレミアムウエディング",
      "ピュアホワイトウエディング",
      "ピュアフレッシュウエディング",
      "フレッシュピンクベアトップ",
      "スターシャインベスト",
      "レッドロックベアトップ"
    ],
    "★3": [
      "アイプリバースポッピンハート",
      "アイプリバースポッピンハートグリーン",
      "アイプリバースミラクルムーン",
      "アイプリバースミラクルムーンオレンジ",
      "アイプリバーススカーレットバタフライ",
      "フラワーチュール",
      "フラワーチュールミント",
      "ゴージャスビジュー",
      "ゴージャスビジューモスグリーン",
      "ハニービー",
      "ハニービーリーフ",
      "スターメロディ",
      "ハートメロディ",
      "スターパーティー",
      "スターパーティーいちごチョコ",
      "スターパーティーほしぞらブルー"
    ],
    "★2": [
      "パラダイスがくえんせいふく１ねん",
      "パラダイスがくえんせいふく2ねん",
      "ラブリーアイドルイエローミント",
      "ラブリーアイドルホワイトパープル",
      "クールアイドルグリーンピンク",
      "クールアイドルレッドイエロー",
      "ハッピーチアライトグリーン",
      "セーラーカジュアルラブリーパープル"
    ],
    "1だんマイキャラツアー": [
      "スプリングツアー2024ひがし",
      "スプリングツアー2024にし",
      "スプリングツアー2024ぜんこく"
    ]
  },
  "２だん": {
    "2だん後半★★★★ピックアップ": [
      "フラワーマーチバズリウム",
      "ポッピンハートバズリウム",
      "ミラクルムーンバズリウム",
      "かにざコーラル",
      "おとぎばなししらゆきひめ",
      "おとぎばなししらゆきひめポイズン",
      "エレガントジュエルブルー",
      "エレガントジュエルレッド",
      "フラワーメモリー",
      "フラワーメモリーパープル",
      "リトルフェアリー",
      "リトルフェアリーグリーン"
    ],
    "プリパラ②": [
      "マリオネットミューサイリウム",
      "エンジェリックファンシー",
      "クリスタルスノープリンセス",
      "ウィッシュリボンアイドルL",
      "ウィッシュリボンアイドルM",
      "ウィッシュリボンアイドルS"
    ],
    "2だん前半★★★★ピックアップ": [
      "ロゼッションバズリウム",
      "スカーレットバタフライバズリウム",
      "ふたござシトリン",
      "フレッシュレモンピンク",
      "フレッシュレモンブルー",
      "マジシャンキャット",
      "マジシャンキャットピンク",
      "チェックメイト",
      "ロマンスシャンデリア",
      "ロマンスシャンデリアピンク"
    ],
    "第1回アイプリグランプリ": [
      "ローズグランプリ"
    ],
    "プリパラ①": [
      "ひみつのプリパラらぁら",
      "ひみつのプリパラみれぃ",
      "ひみつのプリパラそふぃ",
      "パラダイス",
      "トゥインクルリボンサイリウム",
      "キャンディアラモードサイリウム",
      "ホリックトリックサイリウム"
    ],
    "初音ミクコラボ": [
      "はつねミクコーデ"
    ],
    "P丸様。コラボ": [
      "Ｐまるさま。コーデ"
    ],
    "★3": [
      "アイプリバースフラワーマーチ",
      "アイプリバースフラワーマーチパープル",
      "アイプリバースロゼッション",
      "アイプリバースロゼッショングリーン",
      "ひまわりサマー",
      "ひまわりサマーレッド",
      "ぽんぽんすずらん",
      "ぽんぽんすずらんピンク",
      "ローズプリンス",
      "ローズプリンスライトブルー",
      "ミルキーウェイ",
      "ミルキーウェイオレンジ",
      "ことりメルヘン",
      "ことりメルヘンナイト",
      "クローバーメロディ",
      "ひらめきたんてい",
      "ひらめきたんていクラシック"
    ],
    "★2": [
      "パラダイスがくえんせいふく１ねん",
      "パラダイスがくえんせいふく2ねん",
      "ラブリーアイドルオレンジレッド",
      "クールアイドルナチュラル",
      "クールアイドルオレンジブルー",
      "ハッピーチアグレープソーダ",
      "セーラーカジュアルエメラルド",
      "チューリップビタミンイエロー"
    ],
    "2だん マイキャラツアー": [
      "レイニーツアー2024ひがし",
      "レイニーツアー2024にし",
      "レイニーツアー2024ぜんこく"
    ]
  },
  "３だん": {
    "3だん後半　★★★★ピックアップ": [
      "レインボーキャンディバズリウム",
      "ベアベアベアバズリウム",
      "おとめざカーネリアン",
      "おとぎばなしあかずきん",
      "おとぎばなしあかずきんイエロー",
      "カワイイあめちゃん",
      "カワイイくまさん",
      "おやすみメリー",
      "おやすみメリーモーニング",
      "ハッピーバースデー！みつき",
      "ハッピーバースデー！リンリン"
    ],
    "アイドルタイムプリパラ➁": [
      "ファンタジータイムドリーム",
      "ときのコーデ",
      "マイ☆ドリームミルキーブルー",
      "マイ☆ドリームミルキーオレンジ",
      "マイ☆ドリームミルキーパープル"
    ],
    "3だん前半　★★★★ピックアップ": [
      "シークレットフレンズ∞バズリウムピンク",
      "シークレットフレンズ∞バズリウムブルー",
      "シークレットフレンズ∞バズリウムイエロー",
      "ししざダイヤモンド",
      "かれいなるきんぎょ",
      "かれいなるきんぎょブルー",
      "カラフルキャンディ",
      "カラフルキャンディイエロー",
      "ハッピーバースデー！ひまり"
    ],
    "第2回アイプリグランプリ": [
      "マーメイドグランプリピンク",
      "マーメイドグランプリブルー",
      "マーメイドグランプリイエロー"
    ],
    "アイドルタイムプリパラ①": [
      "ひみつのアイドルタイムゆい",
      "ひみつのアイドルタイムにの",
      "ひみつのアイドルタイムみちる",
      "ファンタジータイムサイリウム",
      "ネオンドロップサイリウム",
      "メルティリリィサイリウム"
    ],
    "サンリオキャラクターズコラボ": [
      "リトルツインスターズ パーティーピンク",
      "リトルツインスターズ パーティーブルー",
      "ポムポムプリン パーティー",
      "ハローキティ パーティー",
      "シナモロール パーティー",
      "ポチャッコ パーティー",
      "マイメロディ パーティー",
      "クロミ パーティー"
    ],
    "TGC 2024 A/W": [
      "フレッシュレモンゆめかわ"
    ],
    "★★★": [
      "アイプリバースレインボーキャンディ",
      "アイプリバースベアベアベア",
      "さわやかマリン",
      "トロピカルサマー",
      "レディーフライト",
      "アイスクリーム",
      "アイスクリームオレンジ",
      "ティーパーティー",
      "ティーパーティーネイビー"
    ],
    "★★": [
      "パラダイスがくえんなつふく１ねん",
      "パラダイスがくえんなつふく２ねん",
      "ラブリーアイドルレッド",
      "ラブリーアイドルオレンジ",
      "クールアイドルイエロー",
      "クールアイドルネイビー",
      "クールアイドルグリーン",
      "ハッピーチアグリーン",
      "セーラーカジュアルオレンジ"
    ],
    "2024サマーツアー": [
      "トロピカルサマーブルー",
      "ひまわりサマーブルー",
      "サマーTシャツ"
    ]
  },
  "４だん": {
    "4だん後半　★★★★ピックアップ": [
      "ラブマイミュージックバズリウム",
      "シークレットフレンズ∞バズリウムピンク",
      "シークレットフレンズ∞バズリウムブルー",
      "シークレットフレンズ∞バズリウムイエロー",
      "さそりざタイガーアイ",
      "おとぎばなしピーターパン",
      "おとぎばなしピーターパンレッド",
      "こあくまロック",
      "こあくまロックわたあめピンク",
      "キューティーラビットイエロー",
      "キューティーラビット",
      "ハッピーバースデー！チィ"
    ],
    "キラッとプリ☆チャン➁": [
      "ミラクル☆キラッツグループキラッと",
      "フラワーショップフリージア",
      "チアリーダーグリーン",
      "ゴシックフリルナイトブルー",
      "サマーメイドブラックベリー"
    ],
    "4だん前半　★★★★ピックアップ": [
      "カルテットスターバズリウムハート",
      "カルテットスターバズリウムスペード",
      "カルテットスターバズリウムダイヤ",
      "カルテットスターバズリウムクラブ",
      "てんびんざターコイズ",
      "ミラクルハロウィンピンク",
      "ミラクルハロウィンブルー",
      "ミラクルハロウィンイエロー",
      "ゴーストハロウィン",
      "ゴーストハロウィングリーン",
      "ハッピーバースデー！アイリ"
    ],
    "第3回アイプリグランプリ": [
      "フェザーグランプリクールレッド",
      "フェザーグランプリクールブルー",
      "フェザーグランプリラブリーグリーン",
      "フェザーグランプリラブリーオレンジ"
    ],
    "キラッとプリ☆チャン①": [
      "ひみつのプリ☆チャンみらい",
      "ひみつのプリ☆チャンえも",
      "ひみつのプリ☆チャンりんか",
      "スイートハニーキラッと",
      "ガールズエールキラッと",
      "シークレットアリスキラッと"
    ],
    "オシャレ魔女 ラブandベリー": [
      "ピタTガール",
      "ピチッとクロT",
      "キャンディテーラード",
      "クラシックバイオレット"
    ],
    "★★★": [
      "アイプリバースラブマイミュージック",
      "ふわもこかいじゅう",
      "いたずらモンスター",
      "パンキッシュペンギン",
      "パンキッシュペンギンポップ",
      "おえかきパレット",
      "おえかきパレットやんちゃブルー",
      "スターカウガール",
      "ハーバリウム",
      "クラシックライブラリー"
    ],
    "★★": [
      "パラダイスがくえんせいふく１ねん",
      "パラダイスがくえんせいふく2ねん",
      "ラブリーアイドルグリーン",
      "ラブリーアイドルフレッシュいちご",
      "クールアイドルオレンジ",
      "クールアイドルパープル",
      "チューリップグリーン",
      "チューリップパープル"
    ],
    "2024オータムツアー": [
      "オータムTシャツ",
      "いたずらモンスターオータムパンプキン",
      "クラシックライブラリーオータムスカイ"
    ]
  },
  "５だん": {
    "5だん後半　★★★★ピックアップ": [
      "フラワーマーチプリンセスバズリウムブルー",
      "フラワーマーチバズリウムピュアホワイト",
      "やぎざオニキス",
      "おとぎばなしワンダーランド",
      "ぴょんぴょんうさぎ",
      "おしょうがつピンク",
      "おしょうがつブルー",
      "おしょうがつイエロー",
      "ハッピーバースデー！タマキ"
    ],
    "ワッチャプリマジ！②": [
      "スパークスター",
      "エレガントジュエル",
      "テクノマジカルピンク",
      "テクノマジカルブルー"
    ],
    "5だん前半　★★★★ピックアップ": [
      "フラワーマーチプリンセスバズリウム",
      "いてざサファイア",
      "かみなりぐも",
      "かみなりぐもブラック",
      "スペシャルクリスマスレッド",
      "スペシャルクリスマスブルー",
      "スペシャルクリスマスグリーン",
      "スペシャルクリスマスオレンジ",
      "フラワーメモリーピュアホワイト",
      "ハッピーバースデー！つむぎ"
    ],
    "バズリウムひろば": [
      "ポッピンハートバズリウム",
      "ミラクルムーンバズリウム",
      "フラワーマーチバズリウム",
      "スカーレットバタフライバズリウム",
      "ロゼッションバズリウム",
      "レインボーキャンディバズリウム",
      "ベアベアベアバズリウム",
      "ラブマイミュージックバズリウム"
    ],
    "第4回アイプリグランプリ": [
      "オーロラスノーグランプリ",
      "ぷるるんゼリーミルク",
      "オーロラスノーグランプリライラック"
    ],
    "ワッチャプリマジ！①": [
      "ひみつのプリマジまつり",
      "ひみつのプリマジひな",
      "ひみつのプリマジあまね",
      "ひみつのプリマジあうる",
      "ハートフェザー",
      "メカニックビート"
    ],
    "【推しの子】コラボ": [
      "【おしのこ】 アイ コーデ"
    ],
    "★★★": [
      "アイプリバースフラワーマーチプリンセス",
      "あめぽつぽつ",
      "たいようさんさん",
      "たんけんか",
      "たんけんかオレンジ",
      "うらないし",
      "フラワーチュールあおぞらブルー",
      "ことりメルヘンブルー",
      "レディーフライトネイビー",
      "アイプリバースラブマイミュージックピンク",
      "ステンドグラスクッキー"
    ],
    "★★": [
      "ひまりのアイムゥ",
      "みつきのアイムゥ",
      "つむぎのアイムゥ",
      "ファンタジースノー",
      "ファンタジースノーナイト"
    ],
    "2024→2025ウィンターツアー": [
      "ウィンターTシャツ",
      "うらないしブラック",
      "あめぽつぽつパープル"
    ],
    "ショップワッチャプリマジ！": [
      "プリンセスハートフェザー",
      "ナイトドリーム",
      "リトルプリンセス",
      "フラワーブロッサム",
      "ミラクルユニコーン",
      "パウダースノー"
    ],
    "ショップふゆやすみキャンペーン": [
      "スペシャルクリスマスホワイト"
    ],
    "ショップナムコでプレゼントキャンペーン": [
      "かみなりぐもゆめかわ"
    ],
    "ショップモーリーファンタジー・PALOゲットキャンペーン": [
      "ぴょんぴょんうさぎグリーン"
    ]
  },
  "６だん": {
    "6だん後半　★★★★ピックアップ": [
      "プリンセスアイプリバズリウム",
      "シークレットフレンズ∞バズリウムピュアホワイト",
      "カルテットスターバズリウムスペードスカーレット",
      "カルテットスターバズリウムクラブキャンディ",
      "うおざアクアマリン",
      "おとぎばなしアラビアンナイト",
      "おとぎばなしアラビアンナイトレッド",
      "ガーリーピアノ",
      "ガーリーピアノピンク",
      "ロマンスルージュ",
      "カラフルキャンディハッピー",
      "ハッピーバースデー！サクラ"
    ],
    "プリティーリズム・ディアマイフューチャー②": [
      "ひみつのディアマイフューチャーかりん",
      "ひみつのディアマイフューチャーあやみ",
      "じょうねつのシンフォニア",
      "はばたきのシンフォニア"
    ],
    "6だん前半　★★★★ピックアップ": [
      "ダークカルテットスターバズリウムレッド",
      "ダークカルテットスターバズリウムブルー",
      "ダークカルテットスターバズリウムグリーン",
      "ダークカルテットスターバズリウムオレンジ",
      "みずがめざアメジスト",
      "バレンタインレターピンク",
      "バレンタインレターブルー",
      "バレンタインレターイエロー",
      "チェックメイトシルバー",
      "おやすみメリーナイト"
    ],
    "第5回アイプリグランプリ": [
      "ダークウィッシュメロディ",
      "キューティーラビットダークピンク",
      "ダークウィッシュメロディモノクローム"
    ],
    "プリティーリズム・ディアマイフューチャー": [
      "ひみつのディアマイフューチャーみあ",
      "ひみつのディアマイフューチャーれいな",
      "プリズミー☆サンシャイン",
      "プリズミー☆ナイトスター",
      "プリズミー☆シャイニースター",
      "プリズミー☆シャイニーリボン"
    ],
    "はつねミクコラボ": [
      "ゆきミクコーデ",
      "はつねミクコーデ",
      "さくらミクコーデ"
    ],
    "★★★": [
      "アイプリバースラブマイミュージックダーク",
      "アイプリバーススカーレットバタフライダーク",
      "アイプリバースロゼッションダーク",
      "アイプリバースレインボーキャンディダーク",
      "アイプリバースベアベアベアダーク",
      "メロディコーラス",
      "メロディコーラスクラシック",
      "ポッピンマーチ",
      "クラシックヴァイオリン",
      "おえかきパレットるんるんイエロー",
      "スターメロディパープル"
    ],
    "★★": [
      "サクラのアイムゥ",
      "タマキのアイムゥ",
      "アイリのアイムゥ",
      "リンリンのアイムゥ",
      "ラブリーアイドルホワイトピンク",
      "セーラーカジュアルマリン"
    ],
    "ひみつのミラクルツアー2025": [
      "ひみつのミラクルTシャツ",
      "ポッピンマーチピンク",
      "クラシックヴァイオリンブルー"
    ],
    "ショップワッチャプリマジ！": [
      "フォーチュンスター",
      "ローズクイーン",
      "フライングスカイ",
      "ネオンチェッカー",
      "チャイナネオン",
      "イースターバニー"
    ],
    "ショップはるやすみキャンペーン": [
      "ハーバリウム"
    ]
  },
  "リング１だん": {
    "バズリウムドリーム": [
      "ジュエルバズリウムルビー",
      "ジュエルバズリウムサファイア"
    ],
    "リング１だん後半": [
      "ジュエルバズリウムルビーブルー",
      "ジュエルバズリウムサファイアピンク",
      "カルテットスターバズリウムハートローズ",
      "カルテットスターバズリウムダイヤベア",
      "こいのクリスタルレッド",
      "もりのフラワーショップ",
      "フィーバーデビル",
      "フィーバーエンジェル",
      "プリうさおでかけ",
      "きらきらくらげピュアホワイト",
      "ハッピーバースデー！える"
    ],
    "カルテットスターイチオシひろば": [
      "エレガントジュエルグリーン",
      "エレガントジュエルオレンジ",
      "カワイイあめちゃんレッド",
      "カワイイくまさんブルー",
      "スカーレットバタフライバズリウム",
      "ロゼッションバズリウム",
      "レインボーキャンディバズリウム",
      "ベアベアベアバズリウム"
    ],
    "リング1だん前半": [
      "ジュエルバズリウムダイヤ",
      "ジュエルバズリウムアクアマリン",
      "フレンドスターグランプリピンク",
      "フレンドスターグランプリブルー",
      "こいのクリスタルピンク",
      "ベリキューデニム",
      "ベリキューデニムラブ",
      "フレッシュレモンピンク",
      "フレッシュレモンブルー",
      "ハッピーバースデー！じゅりあ"
    ],
    "つむぎ＆チィイチオシひろば": [
      "フラワーマーチバズリウムパープル",
      "ラブマイミュージックバズリウムイエロー",
      "こあくまロックイエロー",
      "ぽんぽんすずらんパープル",
      "フラワーメモリー",
      "かみなりぐも",
      "フラワーマーチバズリウム",
      "ラブマイミュージックバズリウム",
      "フラワーマーチプリンセスバズリウム"
    ],
    "プリティーリズム・レインボーライブ": [
      "ひみつのレインボーライブなる",
      "ひみつのレインボーライブあん",
      "ひみつのレインボーライブいと",
      "セブンスコーデラブリー",
      "セブンスコーデポップ",
      "セブンスコーデクール"
    ],
    "リカちゃんコラボ": [
      "ゆめみるリカちゃんコーデ"
    ],
    "超ときめき♡宣伝部コラボ": [
      "ときせん ジュリ コーデ",
      "ときせん かなみん コーデ"
    ],
    "第1回アイプリコンテスト": [
      "エターナルジュエルラブジュリエル　じゅりあ",
      "エターナルジュエルラブジュリエル　える"
    ],
    "★★★": [
      "アイプリバースキューティーカラットクール",
      "アイプリバースキューティーカラットラブリー",
      "アイプリバースキューティーカラットクールピンク",
      "アイプリバースキューティーカラットラブリーブルー",
      "アイプリバースポッピンハート",
      "アイプリバースミラクルムーン",
      "バタフライマジックネイビー",
      "ゴージャスビジューレッド",
      "ひらめきたんていホワイト",
      "ふわもこかいじゅうグリーン",
      "ティーパーティーシトロン",
      "いたずらモンスターブルー"
    ],
    "★★": [
      "パラダイスがくえんせいふく２ねん",
      "パラダイスがくえんせいふく１ねん",
      "ラブリーアイドルシルバー",
      "クールアイドルゴールド",
      "ハッピーチアゴールド",
      "セーラーカジュアルシルバー",
      "ハッピーチアピンク",
      "セーラーカジュアルブルー"
    ],
    "ショップワッチャプリマジ！": [
      "メモリージュエルアイシクル",
      "スターバンドガール",
      "アカデミー",
      "エンジェルバブル",
      "パンキッシュハートレッド",
      "ペイントルック"
    ]
  },
  "リング２だん": {
    "バズリウムドリーム": [
      "スペースバズリウムスターズピンク",
      "スペースバズリウムスターズブルー"
    ],
    "プレミアムリングシリーズ": [
      "ときめきビジューツイン　じゅりあ",
      "ときめきビジューツイン　える"
    ],
    "アイプリ2だん後半": [
      "スペースバズリウムスターズキューティー",
      "スペースバズリウムスターズマジシャン",
      "しあわせのクリスタルイエロー",
      "わくわくベーカリー",
      "スクールメイツクール",
      "スクールメイツラブリー",
      "スポーティバレエコアミント",
      "スペースダイナーレッド",
      "ローズグランプリピンク",
      "ハッピーバースデー！おとめ"
    ],
    "プリティーボーイズイチオシひろば": [
      "ギャラティックブルー",
      "ギャラティックレッド",
      "ギャラティックパープル",
      "ヒロさまコーデ",
      "ハーネスルックレッド",
      "ハーネスルックブルー"
    ],
    "リング2だん前半": [
      "スペースバズリウムギャラクシー",
      "スペースバズリウムプラネット",
      "エターナルジュエルポッピンドリーミン　ひまり",
      "エターナルジュエルポッピンドリーミン　みつき",
      "しあわせのクリスタルグリーン",
      "スポーティバレエコア",
      "アイドルチェッククール",
      "アイドルチェックラブリー",
      "スペースダイナー",
      "ウェルカムチェリーレッド",
      "ぷるるんゼリーオレンジ",
      "ハッピーバースデー！すばる"
    ],
    "ひまり＆みつきイチオシひろば": [
      "ポッピンハートバズリウムプリうさ",
      "ミラクルムーンバズリウムプリねこ",
      "フレンドスターグランプリホワイトピンク",
      "フレンドスターグランプリホワイトブルー",
      "ウェルカムチェリー",
      "きらきらくらげブルー",
      "ぴょんぴょんうさぎ",
      "おとぎばなしワンダーランド"
    ],
    "サンリオキャラクターズコラボ": [
      "マイメロディ なかよし",
      "クロミ なかよし",
      "こぎみゅん なかよし",
      "ハンギョドン なかよし",
      "ハローキティ なかよし",
      "シナモロール なかよし",
      "ポチャッコ なかよし",
      "ポムポムプリン なかよし"
    ],
    "超ときめき♡宣伝部コラボ": [
      "ときせん ひとちゃん コーデ",
      "ときせん おはる コーデ"
    ],
    "アイプリコンテスト": [
      "エターナルスペースジャンピンロケットクール",
      "エターナルスペースジャンピンロケットラブリー"
    ],
    "★★★": [
      "アイプリバースフューチャースクールクール",
      "アイプリバースフューチャースクールクールピンク",
      "アイプリバースフューチャースクールラブリー",
      "アイプリバースフューチャースクールラブリーブルー",
      "アイプリバースポッピンハート",
      "アイプリバースミラクルムーン",
      "アイプリバースフラワーマーチ",
      "こんぺいとう",
      "こんぺいとうピンク",
      "ローズプリンスイエロー",
      "クラシックヴァイオリンもりのおんがくたい",
      "ハーバリウムパープル"
    ],
    "★★": [
      "パラダイスがくえんなつふく１ねん",
      "パラダイスがくえんなつふく２ねん",
      "ミルキーウェイわかくさ",
      "ラブリーアイドルおとめピンク",
      "さわやかマリンサマー",
      "チューリップパステルパープル",
      "じゅりあのアイムゥ",
      "えるのアイムゥ"
    ],
    "ショップワッチャプリマジ！": [
      "スペーストラベラー",
      "ハッピーデニム",
      "アーガイルニット",
      "ポッピンスウィム",
      "マーチングブルー",
      "ハッピーセーラー"
    ],
    "ショップタイトーステーションゲットキャンペーン": [
      "リッチベリータルトミント"
    ],
    "ショッププリティーシリーズ15周年": [
      "ポッピンハートバズリウム１５しゅうねん"
    ]
  },
  "リング３だん": {
    "バズリウムドリーム": [
      "アニマルバズリウムプードルピンク",
      "アニマルバズリウムプードルブルー"
    ],
    "プレミアムリングシリーズ": [
      "あこがれコズミックツイン　すばる",
      "あこがれコズミックツイン　おとめ"
    ],
    "リング3だん後半": [
      "アニマルバズリウムパンサー",
      "アニマルバズリウムタイガー",
      "おしゃれのクリスタルブルー",
      "しあわせナース",
      "わいるど☆すたーパープル",
      "わいるど☆すたーレッド",
      "フラワーガーデンブルー",
      "おとぎばなしアラビアンナイトブルー",
      "マーメイドグランプリレッド"
    ],
    "ダークカルテットスターイチオシひろば": [
      "ダークカルテットスターバズリウムホワイトレッド",
      "ダークカルテットスターバズリウムホワイトブルー",
      "ダークカルテットスターバズリウムホワイトグリーン",
      "ダークカルテットスターバズリウムホワイトオレンジ",
      "ダークカルテットスターバズリウムレッド",
      "ダークカルテットスターバズリウムブルー",
      "ダークカルテットスターバズリウムグリーン",
      "ダークカルテットスターバズリウムオレンジ"
    ],
    "リング3だん前半": [
      "アニマルバズリウムプードルイエロー",
      "おしゃれのクリスタルオレンジ",
      "ウィッシュメロディグランプリ",
      "フラワーガーデン",
      "アニマルロックブラック",
      "アニマルロックレッド",
      "おとぎばなしアラビアンナイトピンク",
      "スクールメイツクールミント",
      "ハッピーバースデー！ビビ"
    ],
    "プリティーシリーズ15周年イチオシひろば": [
      "ひみつのプリマジひまり",
      "ひみつのディアマイフューチャーみつき",
      "フレッシュピンクベアトップ",
      "プリズミー☆サンシャイン",
      "セブンスコーデラブリー",
      "トゥインクルリボンサイリウム",
      "ファンタジータイムサイリウム",
      "スイートハニーキラッと",
      "ハートフェザー"
    ],
    "すみっコぐらしコラボ": [
      "てんしなえびてん だいすき"
    ],
    "超ときめき♡宣伝部コラボ": [
      "ときせん あきちゃん コーデ",
      "ときせん ひよりん コーデ"
    ],
    "第3回アイプリコンテスト": [
      "エターナルアニマルビビアンチィ　チィ",
      "エターナルアニマルビビアンチィ　ビビ"
    ],
    "★★★": [
      "アイプリバースラブマイミュージックタイガー",
      "アイプリバースポッピンハート",
      "アイプリバースフラワーマーチ",
      "アイプリバースラブマイミュージック",
      "おえかきパレットブルーベージュ",
      "スターカウガールグリーン",
      "ことりメルヘンイエロー",
      "かれいなるきんぎょブラック",
      "クラシックライブラリーパステル",
      "うさぎぬいぐるみ",
      "パンキッシュペンギンパステル",
      "スターメロディレッド",
      "ハートメロディネイビー"
    ],
    "★★": [
      "スターパーティーよぞらネイビー",
      "ハニービーフラワー",
      "トロピカルサマーイエロー",
      "クールアイドルホワイトレッド",
      "すばるのアイムゥ",
      "おとめのアイムゥ"
    ],
    "ショップ ワッチャプリマジ！": [
      "ぺんぺんぺんぎん",
      "にゃんこみけ",
      "パンダチャイナ",
      "タテジマなりきり",
      "わんわんダルメシアン",
      "くまくまパーク"
    ],
    "ショップ 夏休みキャンペーン": [
      "プリうさおでかけ"
    ],
    "ショップ プリティーシリーズ15周年": [
      "ミラクルムーンバズリウム１５しゅうねん"
    ],
    "ショップ モーリーファンタジー＆PALOゲットキャンペーン": [
      "マジシャンキャットミステリアス"
    ]
  },
  "リング４だん": {
    "バズリウムドリーム": [
      "フラワーバズリウムコスモスピンク",
      "フラワーバズリウムコスモスブルー"
    ],
    "プレミアムリングシリーズ": [
      "じしんのアニマルツイン　ビビ",
      "じしんのアニマルツイン　チィ"
    ],
    "リング4だん後半": [
      "フラワーバズリウムコスモスクローバー",
      "フラワーバズリウムコスモスカンパニュラ",
      "ちしきのクリスタルブラック",
      "カラフルシャインイエロー",
      "カラフルシャインパープル",
      "フレッシュレモンときめきゴールド",
      "フレッシュレモンときめきシルバー",
      "フェザーグランプリクールパープル",
      "スペースダイナークリームソーダ"
    ],
    "カルテットスターイチオシひろば": [
      "スカーレットバタフライバズリウムブルー",
      "ロゼッションバズリウムレッド",
      "レインボーキャンディバズリウムイエロー",
      "ベアベアベアバズリウムグリーン",
      "カルテットスターバズリウムスペードスカーレット",
      "カルテットスターバズリウムハートローズ",
      "カルテットスターバズリウムクラブキャンディ",
      "カルテットスターバズリウムダイヤベア"
    ],
    "リング4だん前半": [
      "フラワーバズリウムカンパニュラ",
      "フラワーバズリウムクローバー",
      "ちしきのクリスタルパープル",
      "ときめきハロウィンオレンジ",
      "ときめきハロウィンブルー",
      "おとぎばなしかぐやひめピュアピンク",
      "プリうさおでかけパープル",
      "フラワーガーデンピンク",
      "アニマルロックホワイト"
    ],
    "じゅりあ＆える イチオシひろば": [
      "ジュエルバズリウムダイヤピンク",
      "ジュエルバズリウムアクアマリングリーン",
      "ベリキューデニムスプリング",
      "スポーティバレエコアサマー",
      "ジュエルバズリウムダイヤ",
      "ジュエルバズリウムアクアマリン",
      "フィーバーデビル",
      "フィーバーエンジェル"
    ],
    "アイカツ！×プリパラひろば": [
      "ピンクパレードコーデ",
      "ドリームTRサイリウム",
      "ドリームBMサイリウム",
      "ドリームFPサイリウムD",
      "ドリームFPサイリウムR",
      "ノクターンスカイアイドルS",
      "キャンディアラモードサイリウム",
      "ホリックトリックサイリウム",
      "ウィッシュリボンアイドルL"
    ],
    "超ときめき♡宣伝部コラボ": [
      "シンデレラのラララ ジュリ コーデ",
      "シンデレラのラララ かなみん コーデ"
    ],
    "第4回アイプリコンテスト": [
      "エターナルフラワールミナスフローラ　リング",
      "エターナルフラワールミナスフローラ　つむぎ"
    ],
    "★★★": [
      "アイプリバースプリンセスリング",
      "アイプリバースフラワーマーチプリンセス",
      "アイプリバースミラクルムーン",
      "スターアイドル",
      "スターアイドルネイビー",
      "チョコポップミント",
      "ミラクルハロウィングリーン",
      "クローバーメロディオレンジ",
      "ドーナツパティシエールレッド",
      "たいようさんさんブルー",
      "ぽんぽんすずらんホワイトパープル"
    ],
    "★★": [
      "キューティーキャット",
      "キューティーキャットパープル",
      "チューリップピュアホワイト",
      "ラブリーアイドルハロウィン",
      "ビビのアイムゥ",
      "チィのアイムゥ"
    ],
    "ショップ ワッチャプリマジ！": [
      "コスメティックフラワー",
      "スプリングフラワー",
      "フラワーパターン",
      "すずらんかれん",
      "ローズハート",
      "おはなまんかい"
    ],
    "ショップ ナムコでゲット♪「カラフルシャインブルー」キャンペーン": [
      "カラフルシャインブルー"
    ]
  },
  "リング５だん": {
    "バズリウムドリーム": [
      "メロディバズリウムハーモニーピンク",
      "メロディバズリウムハーモニーブルー"
    ],
    "プレミアムリングシリーズ": [
      "ゆうきのブロッサムツイン　リング",
      "ゆうきのブロッサムツイン　つむぎ"
    ],
    "リング5だん後半": [
      "メロディバズリウムハーモニーロイヤルレッド",
      "メロディバズリウムハーモニーロイヤルブルー",
      "アイドルのクリスタルホワイト",
      "カルテットレジェンド",
      "カルテットレジェンドホワイト",
      "ガーリーピアノイエロー",
      "オーロラスノーグランプリピンク",
      "スクールメイツクールブルー",
      "スクールメイツラブリーピンク"
    ],
    "リング5だん前半": [
      "メロディバズリウムアンサンブルレッド",
      "メロディバズリウムアンサンブルブルー",
      "メロディバズリウムアンサンブルグリーン",
      "メロディバズリウムアンサンブルオレンジ",
      "アイドルのクリスタルラブリーピンク",
      "ひみつのクリスマスレッド",
      "ひみつのクリスマスネイビー",
      "ゴシックベアレッド",
      "ファンタジーリングブルー"
    ],
    "すばる＆おとめ イチオシひろば": [
      "スペースバズリウムギャラクシーピンク",
      "スペースバズリウムプラネットネイビー",
      "アイドルチェッククールグリーン",
      "アイドルチェックラブリーパープル",
      "スペースバズリウムギャラクシー",
      "スペースバズリウムプラネット",
      "スクールメイツクール",
      "スクールメイツラブリー"
    ],
    "キラッとプリ☆チャン": [
      "ドーリーワルツキラッと",
      "ロマンスビートキラッと",
      "ユニバースクイーンキラッと",
      "スイートハニーキラッと"
    ],
    "第5弾推しの子コラボ": [
      "【おしのこ】 ルビー コーデ"
    ],
    "超ときめき♡宣伝部コラボ": [
      "シンデレラのラララ ひとちゃん コーデ",
      "シンデレラのラララ おはる コーデ"
    ],
    "第5回アイプリコンテスト": [
      "エターナルメロディカルテットスター　サクラ",
      "エターナルメロディカルテットスター　タマキ",
      "エターナルメロディカルテットスター　アイリ",
      "エターナルメロディカルテットスター　リンリン"
    ],
    "★★★": [
      "アイプリバーススカーレットバタフライ",
      "アイプリバースロゼッション",
      "アイプリバースレインボーキャンディ",
      "アイプリバースベアベアベア",
      "マジカルカラット",
      "マジカルカラットホワイト",
      "ロッキンスター",
      "おしょうがつパープル",
      "リトルフェアリーイエロー",
      "メロディコーラスエレガント",
      "クローバーメロディグリーン",
      "うさぎぬいぐるみブラック"
    ],
    "★★": [
      "パラダイスがくえんせいふく3ねん",
      "パラダイスがくえんせいふくすばる",
      "キューティーキャットナイト",
      "ファンタジースノーフォレスト",
      "シツムゥ",
      "デビムゥ",
      "ジェルムゥ"
    ],
    "おとぎばなしひろば": [
      "おとぎばなしシンデレラ",
      "おとぎばなししらゆきひめ",
      "おとぎばなしあかずきん",
      "おとぎばなしピーターパン",
      "おとぎばなしワンダーランド",
      "おとぎばなしアラビアンナイト"
    ],
    "ショップ ふゆやすみキャンペーン": [
      "チェックメイト",
      "スペシャルクリスマスホワイト",
      "おやすみメリー",
      "おしょうがつピンク"
    ],
    "ショップ ワッチャプリマジ！": [
      "ホワイトクリスマスツリースマイル",
      "クリスマスベル",
      "あったかニットサンタ",
      "あけおめラブエレメンツ",
      "はんなりゆかた",
      "おこおこおに"
    ]
  }
}